cmjang/CtrBoard-H7_IMU_Altitude/AC6_Code/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Driver/UART_STM32H7xx.c
/* -----------------------------------------------------------------------------
 * Copyright (c) 2013-2023 Arm Limited (or its affiliates).
 * All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 *
 * $Date:        27. February 2023
 * $Revision:    V2.3
 *
 * Driver:       Driver_USART1/2/3/4/5/6/7/8/9/10/21
 *
 * Configured:   via CubeMX
 * Project:      USART Driver for ST STM32H7xx
 * -------------------------------------------------------------------------- */

/*! \page stm32h7_uart USART (Asynchronous mode)

# Revision History

- Version 2.3
  - Updated DMA and Data Cache handling (improved code readability and maintainability)
  - Made variable status volatile (solved potential LTO problems)
- Version 2.2
  - Corrected Flow Control capabilities
  - Corrected GetStatus function and status flags handling
  - Corrected Data Cache maintenance operations in 9-bit mode
  - Removed Rx Timeout capability and event signalization
- Version 2.1
  - Corrected GetTxCount/GetRxCount implementation
- Version 2.0
  - LPUART1 interface accessed by Driver_USART21 (previously by Driver_USART9)
  - Added USART10 interface accessed by Driver_USART10
  - Added LPUART1 interface accessed by Driver_USART21
- Version 1.3
  - Added UART interface for LPUART1 (Driver_USART9)
  - Corrected Data Cache handling (checking of data alignment and size is configurable)
- Version 1.2
  - Updated Get Count functionality
- Version 1.1:
  - Corrected UARTx/USARTx related typing mistakes
- Version 1.0
  - Initial release

# Capabilities

This driver supports **Asynchronous** mode.

# Instances

Hardware resource relating to driver instance is shown in the table below:

Driver Instance | Hardware Resource
:---------------|:-----------------:
Driver_USART1   | USART1
Driver_USART2   | USART2
Driver_USART3   | USART3
Driver_USART4   | UART4
Driver_USART5   | UART5
Driver_USART6   | USART6
Driver_USART7   | UART7
Driver_USART8   | UART8
Driver_USART9   | UART9
Driver_USART10  | USART10
Driver_USART21  | LPUART1

\note
The **CMSIS Driver:USART (API):USART** component in the **Manage Run-Time Environment** dialog adds multiple C source files to the project.\n
The interface selection in STM32CubeMX selects the actual implementation that is compiled: IrDA, SmartCard, UART or USART.

# Limitations

STM32 HAL limitations:
 - Rx Timeout event disables further reception
 - No callback available for Rx Idle event
 - Manual control of modem lines is not supported
 - Break character is handled as framing error

DMA usage limitations:
 - The size of DCache line on Cortex M7 is 32 Bytes. To safely perform
   DCache maintenance operations, data must be aligned to a 32 Byte boundary
   and data size must be n*32 Bytes. By default, the alignment and size of
   provided data are checked in UART transfer functions. If data is not
   aligned to a 32 Byte boundary or data size is not n*32 Bytes, DMA is
   not used and IRQ transfer is performed.
 - Advanced user can disable data alignment and/or data size checking by
   setting UART_DCACHE_DATA_xX_ALIGNMENT and/or UART_DCACHE_DATA_xX_SIZE to 0.
   The user must be aware that performing DCache maintenance operations on
   data that is not aligned to a 32 Byte boundary or that is not n*32 Bytes
   in size can be dangerous and can corrupt other data that is also maintained
   by the same 32 Byte DCache line.

# Configuration

## Compile-time

Definitions used for compile-time configuration of this driver are shown in the table below:

Definition                         | Default value | Value | Description
:----------------------------------|:-------------:|:-----:|:-----------
UART_DCACHE_MAINTENANCE            |     **1**     |   1   | UART DCache maintenance operations: **enabled**
^                                  |       ^       |   0   | UART DCache maintenance operations: **disabled**
UART_DCACHE_DATA_RX_ALIGNMENT      |     **1**     |   1   | UART DCache data Rx alignment check: **enabled**
^                                  |       ^       |   0   | UART DCache data Rx alignment check: **disabled**
UART_DCACHE_DATA_RX_SIZE           |     **1**     |   1   | UART DCache data Rx size check: **enabled**
^                                  |       ^       |   0   | UART DCache data Rx size check: **disabled**
UART_DCACHE_DATA_TX_ALIGNMENT      |     **1**     |   1   | UART DCache data Tx alignment check: **enabled**
^                                  |       ^       |   0   | UART DCache data Tx alignment check: **disabled**
UART_DCACHE_DATA_TX_SIZE           |     **1**     |   1   | UART DCache data Tx size check: **enabled**
^                                  |       ^       |   0   | UART DCache data Tx size check: **disabled**

## STM32CubeMX

The USART driver requires:
  - **UART/USART peripheral clock**
  - **UART/USART** peripheral configured as **Asynchronous**
  - optional **Hardware Flow Control**
  - **UART/USART TX, Rx** and optional **Hardware flow Control pins**
  - optional **DMA** configuration for transfers

# STM32H743I-EVAL Board Configuration

These settings are relevant for this board, for different board please refer to the board
schematic for proper configuration.

Link to [STM32H743I-EVAL board schematic](https://www.st.com/resource/en/schematic_pack/mb1246-h743-e03_schematic.pdf).

## STM32CubeMX

Required peripherals for the **STM32H743I-EVAL** board are listed in the table below:

Peripheral | Mode                         | Description
:---------:|:----------------------------:|:-----------
USART1     | Asynchronous                 | USART1 Controller
PB14       | Alternate Function Push Pull | USART1 TX Pin
PB15       | Alternate Function Push Pull | USART1 RX Pin

\note All settings have to be configured as described in the procedure below. Important settings,
      typically the ones different from default, are emphasized in **bold**.

### Pinout & Configuration tab

  1. In the **Pinout view** window click on a pin and select it's functionality:
        Pin      | Functionality
        :--------|:-------------:
        PB14     | **USART1_TX**
        PB15     | **USART1_RX**
       \n

  2. Under **Categories**: **Connectivity** select **USART1**:

     __Mode__:
       - Mode: **Asynchronous**
       - Hardware Flow Control (RS232): Disable
       - Hardware Flow Control (RS485): unchecked
       - Slave Select(NSS) Management: Disable

     __Configuration__:
       - Parameter Settings: not used
       - User Constants: not used
       - NVIC Settings: configured in later step (under Category: System Core: NVIC)
       - DMA Settings: configured in later step (under Category: System Core: DMA)
       - GPIO Settings:
            Pin Name | Signal on Pin | Pin Context..| GPIO output..| GPIO mode                     | GPIO Pull-up/Pull..| Maximum out..| Fast Mode | User Label
            :--------|:-------------:|:------------:|:------------:|:-----------------------------:|:------------------:|:------------:|:---------:|:----------:
            PB14     | USART1_TX     | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| Low          | n/a       | .
            PB15     | USART1_RX     | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| Low          | n/a       | .
       \n

